<script setup lang="ts">

//　➀ここに、ref関数をインポートしてください


//　➁ ここに、ref関数でリアクティブな変数を作成してください。
// 初期値は0で、変数名はcountにしてください


//　➂　以下のコメント解除を行ってください。リアクティブ変数の値を変動させる関数です。
//　　　　※マウスで範囲選択し、Ctrl+/ を再度行うと、簡単にコメント解除ができます。

// const increment = () => { // カウントを増やす関数
//   count.value++ // refで作成した変数の値を変更する場合は.valueを使う
// }

</script>

<template>
   <!-- ➃ <p></p>内に、マスタッシュ構文を使って、➁の変数を表示してください-->
  <p>現在のカウント：             </p>

  <!-- ➄ 以下のコメント解除をしてください。ボタンクリックしたらincrement関数を実行します。 -->
  <!-- <button @click="increment">増やす</button> -->
</template>